# Bazy danych - zadania

## Psycopg

1. Wczytaj dane z pliku `cars.csv` i wyodrębnij z niego kolumny:
   - `price`
   - `brand`
   - `fuel`
   - `power`
   - `prod_year`


Następnie napisz zapytanie `CREATE`, które utworzy tabelę o takim samym schemacie + dodatkowa kolumna `id` typu `serial`. Wykonaj zapytanie za pomocą `psycopg`.

---
(czas: 16 min.)

In [1]:
import pandas as pd
import psycopg

In [25]:
df = pd.read_csv("cars.csv",
                 # dtype=object,
                 usecols=["price", "brand", "fuel", "power", "prod_year"])
df

       price       brand     fuel  power  prod_year
0      32900       Škoda   Diesel  115.0       2017
1      32500         BMW   Diesel  116.0       2012
2       7900        Fiat  Benzyna   69.0       2012
3      39990         Kia   Diesel  115.0       2012
4      42900         Kia   Diesel  115.0       2012
...      ...         ...      ...    ...        ...
99995  83990        Ford   Diesel  120.0       2020
99996   7400        Audi  Benzyna  125.0       1999
99997  30000         BMW   Diesel  245.0       1999
99998  69000     Peugeot  Benzyna  101.0       2020
99999  18000  Volkswagen  Benzyna  140.0       2007

[100000 rows x 5 columns]

In [26]:
df.dtypes

price          int64
brand         object
fuel          object
power        float64
prod_year      int64
dtype: object

In [3]:
create_query = """CREATE TABLE cars(
    id SERIAL,
    price INTEGER,
    brand TEXT,
    fuel TEXT,
    power SMALLINT,
    prod_year SMALLINT
);
"""

In [15]:
conn = psycopg.connect(
    dbname="postgres", user="postgres", password="postgres", host="localhost",
    cursor_factory=psycopg.ClientCursor
)
cursor = conn.cursor()

In [5]:
cursor.execute(create_query)
conn.commit()

2. Napisz kod, który na podstawie numeru indeksu wiersza dataframe'a, wyciągnie ten wiersz z tabeli, utworzy zapytanie `INSERT` a następnie wykona je na bazie.
---

(czas: 20 min.)

In [6]:
idx = 0

row = df.loc[idx]
row

price         32900
brand         Škoda
fuel         Diesel
power         115.0
prod_year      2017
Name: 0, dtype: object

In [19]:
conn.rollback()

In [20]:
query = f"""INSERT INTO cars (price, brand, fuel, power, prod_year)
        VALUES(%s, %s, %s, %s, %s)"""

In [29]:
row.values

array([32900, 'Škoda', 'Diesel', 115.0, 2017], dtype=object)

In [27]:
tuple(row)

(32900, 'Škoda', 'Diesel', 115.0, 2017)

In [21]:
cursor.mogrify(query, tuple(row))

"INSERT INTO cars (price, brand, fuel, power, prod_year)\n        VALUES(32900, 'Škoda', 'Diesel', 115.0, 2017)"

In [22]:
cursor.execute(query, tuple(row))
conn.commit()

In [32]:
conn_str = "postgresql://postgres:postgres@localhost:5432/postgres"

In [ ]:
pip install sqlalchemy

In [34]:
df.iloc[:5].to_sql("cars", conn_str, if_exists='append', index=False)

5

In [35]:
pd.read_sql("SELECT * FROM cars", conn_str)

   id  price  brand     fuel  power  prod_year
0   1  32900  Škoda   Diesel    115       2017
1   2  32900  Škoda   Diesel    115       2017
2   3  32500    BMW   Diesel    116       2012
3   4   7900   Fiat  Benzyna     69       2012
4   5  39990    Kia   Diesel    115       2012
5   6  42900    Kia   Diesel    115       2012

3. Napisz funkcję, która przyjmie zapytanie typu `SELECT` i wykona je na bazie.

In [36]:
select_query = "SELECT * FROM cars"

def run_select(select_query):
    cursor.execute(select_query)
    return cursor.fetchall()

In [37]:
run_select(select_query)

[(1, 32900, 'Škoda', 'Diesel', 115, 2017),
 (2, 32900, 'Škoda', 'Diesel', 115, 2017),
 (3, 32500, 'BMW', 'Diesel', 116, 2012),
 (4, 7900, 'Fiat', 'Benzyna', 69, 2012),
 (5, 39990, 'Kia', 'Diesel', 115, 2012),
 (6, 42900, 'Kia', 'Diesel', 115, 2012)]

4. Napisz funkcję, która przyjmie `id` wiersza w tabeli, nazwę kolumny oraz nową wartość a następnie zupdatuje tabelę.

In [38]:
def update_value(id_, column, new_value):
    query = f"UPDATE cars SET {column} = %s WHERE id = %s RETURNING *"
    cursor.execute(query, (new_value, id_))
    updated_row = cursor.fetchone()
    conn.commit()
    return updated_row

In [39]:
update_value(1, "fuel", "Benzyna")

(1, 32900, 'Škoda', 'Benzyna', 115, 2017)

5. Napisz funkcję, która przyjmie `id` wiersza w tabeli a następnie go usunie.

In [44]:
def delete_row(id_):
    query = "DELETE FROM cars WHERE id=%s"
    cursor.execute(query, (id_,))
    conn.commit()

In [45]:
delete_row(1)

## SQLAlchemy

1. Utwórz klasę odpowiadającą tabeli `cars` a następnie samą tabelę za pomocą `SQLAlchemy`.


---
(czas: 16 min.)

In [ ]:
# ...

2. Napisz kod, który doda do tabeli wiersz z dataframe'a wykorzystując `SQLAlchemy`.

   
---
(czas: 8 min.)

In [ ]:
# ...

3. Napisz kod, który wyciągnie dane z dataframe'a na różne sposoby

In [ ]:
# ...